Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: If you are running a non-Bluesky app in addition to a PDS deployment, **you will need separate domain names** for your PDS hosting and your app. This is because image and video blobs would otherwise be served from the same domain name as the OAuth and session management pages. This could lead to security issues such as credential theft, and means that using subdomains isn't a practical solution.
ja: PDSデプロイメントに加えてBluesky以外のアプリを実行している場合、PDSホスティングとアプリには**異なるドメイン名が必要**です。そうしないと、画像や動画のblobがOAuthやセッション管理ページと同じドメイン名から提供されることになります。これは認証情報盗難などのセキュリティ問題につながる可能性があり、サブドメインの使用は実用的ではないことを意味します。

source: If you are running multiple processes in parallel, you may also want to leverage [sidecar containers](https://litestream.io/guides/docker/#why-sidecar-containers-work) for your SQLite databases.
ja: 複数プロセスを並列実行する場合、SQLiteデータベースに[サイドカーコンテナ](https://litestream.io/guides/docker/#why-sidecar-containers-work)を利用することもできます。

source: If you are using password auth, you should generate an [app password](/specs/xrpc#app-passwords) for your account rather than using your main account password. If you are using Bluesky as an auth provider, you can generate an app password in your [account settings](https://bsky.app/settings/app-passwords).
ja: パスワード認証を使用している場合は、メインのアカウントパスワードではなく[アプリパスワード](/specs/xrpc#app-passwords)を生成するべきです。Blueskyを認証プロバイダとして使用している場合は、[アカウント設定](https://bsky.app/settings/app-passwords)でアプリパスワードを生成できます。

source: If you aren't using an existing account to post from, you should [create a new account](https://bsky.app/) for your bot. You should also generate an [app password](/guides/sdk-auth) for that account.
ja: 既存アカウントから投稿するつもりでなければ、ボット用に[新しいアカウントを作成](https://bsky.app/)してください。また、そのアカウント用の[アプリパスワード](/guides/sdk-auth)も生成してください。

source: If you believe your birthdate is incorrect, please <0>contact our support team</0>.
ja: 生年月日が正しくない場合は、<0>サポートチームまでご連絡</0>ください。

source: If you believe your birthdate is incorrect, you can update it by <0>clicking here</0>.
ja: 生年月日が正しくない場合は、<0>ここをクリック</0>して更新することができます。

source: If you delete this list, you won't be able to recover it.
ja: このリストを削除すると、復元できなくなります。

source: If you do not have a rev for that repo, download and process the users repo checkpoint from the `com.atproto.sync.getRepo` endpoint.
ja: そのリポジトリのrevがない場合は、`com.atproto.sync.getRepo`エンドポイントからユーザーのリポジトリチェックポイントをダウンロードして処理します。

source: If you had wanted to mute the user for subscribers to your labeler, you could have selected "Mute" from the action drop-down instead. Refer to <a href="https://github.com/bluesky-social/ozone/blob/main/docs/userguide.md#concepts" target="_blank">Ozone Concepts</a> for an explanation of each action.
ja: ラベラーの登録者に対してユーザーをミュートしたい場合は、代わりにアクションのドロップダウンから「Mute」を選択することもできます。各アクションの説明については、<a href="https://github.com/bluesky-social/ozone/blob/main/docs/userguide.md#concepts" target="_blank">OzoneのConcepts</a>を参照してください。

source: If you had wanted to mute the user for subscribers to your labeler, you could have selected "Mute" from the action drop-down instead. Refer to [Ozone Concepts](https://github.com/bluesky-social/ozone/blob/main/docs/userguide.md#concepts) for an explanation of each action.
ja: ラベラーの登録者に対してユーザーをミュートしたい場合は、代わりにアクションのドロップダウンから「Mute」を選択することもできます。各アクションの説明については、[OzoneのConcepts](https://github.com/bluesky-social/ozone/blob/main/docs/userguide.md#concepts)を参照してください。

source: If you have your own domain, you can use that as your handle. This lets you self-verify your identity. <0>Learn more here.</0>
ja: 自分のドメインを持っていれば、ハンドルとして利用できます。これによりあなたのアイデンティティを自己証明できます。<0>詳しくはこちら。</0>

source: If you need to change the *domain name* of a self-hosted PDS, you need to:
ja: セルフホストしたPDSの*ドメイン名*を変更する必要がある場合は、次の操作を行ってください。

source: If you need to link any uploaded images or videos to the records (posts) you create, you will also need: - `blob:*/*`
ja: アップロードした画像や動画を作成するレコード（投稿）に紐づける必要がある場合、以下も必要です。 - `blob:*/*`

source: If you need to update your email, <0>click here</0>.
ja: メールを更新する必要がある場合は、<0>ここ</0>をクリックしてください。

source: If you remove this post, you won't be able to recover it.
ja: この投稿を削除すると、復元できなくなります。

source: If you remove those limits, then the entire PDS might get limited at the [Relay](https://github.com/bluesky-social/indigo/tree/main/cmd/relay) (which itself has default event rate-limits for each PDS host), so be mindful of this if you are not also running your own Relay.
ja: これらの制限を撤廃すると、PDS全体が[リレー](https://github.com/bluesky-social/indigo/tree/main/cmd/relay)で制限される可能性があるため（リレーはPDSホスト毎にデフォルトのイベントレート制限を持ちます）、独自のリレーを実行していない場合は注意してください。

source: If you update your email address, email 2FA will be disabled.
ja: メールアドレスを更新すると、メールでの2要素認証は無効になります。

source: If you want to change your password, we will send you a code to verify that this is your account.
ja: パスワードを変更する場合は、あなたのアカウントであることを確認するためのコードをお送りします。

source: If you want to practice what you've learned, here are some additional challenges you could try:
ja: 学習した内容を実践したい場合は、次の追加の課題に挑戦してみてください:

source: If you want to restrict who can receive notifications for your account's activity, you can change this in <0>Settings → Privacy and Security</0>.
ja: あなたのアクティビティの通知を受信できるユーザーを制限したい場合は、<0>設定 → プライバシーとセキュリティ</0>で変更できます。

source: If you want, you can view the downloaded Lexicon file at `lib/lexicons/app.bsky.post.json`. From here, you can run `lex build` to generate TypeScript types for all of your installed Lexicons:
ja: 必要であれば、ダウンロードしたLexiconファイルを`lib/lexicons/app.bsky.post.json`で確認できます。ここから`lex build`を実行すると、インストール済みLexiconすべてに対してTypeScriptの型を生成できます。

source: If you want, you can view the downloaded Lexicon file at `lib/lexicons/xyz.statusphere.status.json`. From here, you can run `lex build` to generate TypeScript types for all of your installed Lexicons:
ja: 必要であれば、ダウンロードしたLexiconファイルを`lib/lexicons/xyz.statusphere.status.json`で確認できます。ここから`lex build`を実行すると、インストール済みLexiconすべてに対してTypeScriptの型を生成できます。

source: If you're a developer, you can host your own server.
ja: あなたが開発者ならば、自分でサーバーをホストできます。

source: If you're just looking to migrate an account to a new PDS using existing tools, we recommend: - [Migrating PDS Account with `goat`](https://whtwnd.com/bnewbold.net/3l5ii332pf32u) - [PDS MOOver](https://pdsmoover.com/) — a community-developed tool
ja: 既存のツールでアカウントを新しいPDSに移行したいだけであれば、以下をご覧ください。 - [`goat`を使ったPDSアカウント移行](https://whtwnd.com/bnewbold.net/3l5ii332pf32u) - [PDS MOOver](https://pdsmoover.com/) — PDS移行のためのコミュニティツール

source: If you're trying to change your handle or email, do so before you deactivate.
ja: ハンドルやメールアドレスを変えるのであれば、無効化の前に変更してください。

source: If you've ever built a backend with [stream-processing](https://milinda.pathirage.org/kappa-architecture.com/), then you're familiar with the kind of systems we'll be exploring. If you're not &mdash; no worries! We'll step through it. {{className: 'lead'}}
ja: [ストリーム処理](https://milinda.pathirage.org/kappa-architecture.com/)を使用してバックエンドを構築したことがある場合は、これから説明する種類のシステムに精通していることになります。そうでない場合も心配しないでください。順を追って説明します。{{className: 'lead'}}

source: If your app doesn't need long-lived sessions, then this approach is completely fine. But for other use cases, session lifetime will be limited because the app is a "public client", as opposed to a "confidential client". Becoming a confidential client involves establishing a secret key, bound to the client ID. If the client is publicly available and runs on the user's own device, it cannot protect a client secret. Thus, implementing a confidential client necessitates hosting some backend infrastructure, which the [cookbook/go-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/go-oauth-web-app#readme) and [cookbook/python-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/python-oauth-web-app#readme) examples demonstrate (both using the "BFF" pattern, see below).
ja: アプリケーションが長期のセッションを必要としない場合は、このアプローチで問題ありません。ただし、他のユースケースでは、アプリケーションが「機密クライアント」ではなく「パブリッククライアント」であるせいで、セッションの有効期限が制限されます。機密クライアントになるには、クライアントIDに紐付けられた秘密鍵を用意する必要があります。クライアントが公開されていてユーザーのデバイスで実行される場合、クライアントシークレットを保護することができません。したがって、機密クライアントの実装には、[cookbook/go-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/go-oauth-web-app#readme)や[cookbook/python-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/python-oauth-web-app#readme)の例（両方とも後述の"BFF"パターンを使用しています）で示されているバックエンドインフラをホストする必要があります。

source: If your app isn't already running from Part 1, start it with:
ja: パート1からアプリをまだ起動していない場合は、次のように起動します。

source: Image
ja: 画像

source: Image cache cleared
ja: 画像のキャッシュをクリアしました

source: Image cache cleared, freed {0}
ja: 画像のキャッシュをクリアし、 {0} が解放されました

source: Image saved
ja: 画像を保存しました

source: Images cannot be saved unless permission is granted to access your photo library.
ja: 写真ライブラリへのアクセスが許可されない限り、画像を保存できません。

source: Impersonation
ja: なりすまし

source: Implementing Feed Feedback is optional, but can help improve user experience.
ja: フィードフィードバックの実装は任意ですが、ユーザー体験の向上に役立つことがあります。

source: Import Contacts
ja: 連絡先をインポート

source: Import contacts
ja: 連絡先をインポート

source: Import contacts to find your friends
ja: 連絡先をインポートして友達を見つける

source: Import the SDK libraries and go directly to [making requests](/guides/reading-data)! </TabPanel> </TabPanels> </TabGroup>
ja: SDK ライブラリをインポートしたら、そのまま[リクエストの作成](/guides/reading-data)に進みましょう！ </TabPanel> </TabPanels> </TabGroup>

source: In AT, handles are resolved through [DIDs](/specs/did), also known as [Decentralized Identifiers](https://en.wikipedia.org/wiki/Decentralized_identifier). Currently, two different DID prefixes are supported: - `did:web`, which is based on the W3C DID standard. - `did:plc`, which is a DID method developed and implemented by Bluesky. See the [did-method-plc](https://github.com/did-method-plc/did-method-plc) repository for details.
ja: ATでは、ハンドルは[DID](/specs/did)（[分散型識別子](https://en.wikipedia.org/wiki/Decentralized_identifier)）を通じて解決されます。現在、2つの異なるDIDプレフィックスがサポートされています。 - `did:web`（W3C DID標準に基づく） - `did:plc`（Blueskyによって開発および実装されたDIDメソッド） 詳細については[did-method-plc](https://github.com/did-method-plc/did-method-plc)リポジトリを参照してください。

source: In AT, user data is resolved through [DIDs](/guides/sync#data-repositories), also known as [Decentralized Identifiers](https://en.wikipedia.org/wiki/Decentralized_identifier). Most AT Protocol applications use [`did:plc` DIDs](/guides/the-at-stack#did-plc) when registering user accounts.
ja: ATでは、ユーザーデータは[DID](/guides/sync#data-repositories)（別名[分散型識別子](https://en.wikipedia.org/wiki/Decentralized_identifier)）を通じて解決されます。ほとんどのATプロトコルアプリケーションはユーザーアカウント登録時に[`did:plc` DID](/guides/the-at-stack#did-plc)を使用します。

source: In a disaster recovery scenario, you'd pull down all the most recent account database files (which might be missing a few hours of data) and the PDS-wide database files (which should be roughly complete). Then, run a recovery script which applies any repo operations from the PDS-level firehose output. This includes identity and account updates. Then, start the PDS back up.
ja: 災害復旧シナリオでは、最新のアカウントデータベースファイル（数時間分のデータが失われている可能性があります）とPDS全体のデータベースファイル（ほぼ完全であるはず）をすべてプルダウンします。次に、PDSのfirehose出力からリポジトリ操作を適用する復旧スクリプトを実行します。これにはIDとアカウントの更新が含まれます。その後、PDSを再起動します。

source: In a project directory, you can download some existing Lexicons, which will get saved as JSON files in `./lexicons/`:
ja: プロジェクトディレクトリで既存のLexiconをダウンロードすると、`./lexicons/`にJSONファイルとして保存されます。

source: In a way, what we've done is custom-built a database by [turning it inside-out](https://www.youtube.com/watch?v=fU9hR3kiOK0). We simplified the canonical storage into a NoSQL cluster, and then built our own querying engine with the view servers. It's a lot less convenient to build with, but it scales.
ja: ある意味、私たちが行ったのは[データベースを裏返しにして](https://www.youtube.com/watch?v=fU9hR3kiOK0)、データベースをカスタム構築したことです。標準ストレージをNoSQLクラスターに簡素化し、ビューサーバーを使用して独自のクエリエンジンを構築しました。構築の利便性は大幅に低下しますが、拡張性があります。

source: In general, it is best to use existing permission sets for cleaner UI, but you can also request individual permissions and define your own permission sets as needed. Refer to the [for users](#for-users) section for how these requests appear in the OAuth flow.
ja: 一般的には、UIをすっきりさせるために既存の権限セットを使うのが最善ですが、必要に応じて個別の権限を要求したり独自の権限セットを定義することもできます。これらのリクエストがOAuthフローでどのように表示されるかは、[利用者向け](#for-users)セクションを参照してください。

source: In most situations, including versioned references between records, the string format is recommended.
ja: レコード間のバージョン付き参照を含むほとんどの状況では、文字列形式が推奨されます。

source: In order to provide an age-appropriate experience, we need to know your birthdate. This is a one-time thing, and your data will be kept private.
ja: 年齢に応じた体験を提供するために、あなたの生年月日を知る必要があります。これは一回限りのことであり、あなたのデータはプライベートに保たれます。

source: In other words, if you have an app at [https://greensky.app](https://greensky.app/), you should not use [https://pds.greensky.app](https://pds.greensky.app/) as a PDS hostname, you should use something like [https://greensky-pds.net](https://greensky-pds.net/). If you used [https://pds.greensky.social](https://pds.eurosky.social/) (which would make sense), it might rule out an OAuth client app at [https://chat.greensky.social](https://chat.eurosky.social/) in the future. But you could do something like [https://chat.greensky.app](https://chat.eurosky.app/).
ja: 言い換えれば、[https://greensky.app](https://greensky.app/)にアプリがある場合、[https://pds.greensky.app](https://pds.greensky.app/)をPDSホスト名として使用するのではなく、[https://greensky-pds.net](https://greensky-pds.net/)のようなものを使用する必要があります。[https://pds.greensky.social](https://pds.eurosky.social/)を使用した場合（理にかなっているでしょう）、将来[https://chat.greensky.social](https://chat.eurosky.social/)にOAuthクライアントアプリを置くことができなくなります。しかし、[https://chat.greensky.app](https://chat.eurosky.app/)のようにすることはできます。

source: In this case, the most straightforward action is to acknowledge the report without taking further action. Select "Ackonwledge" from the drop-down, provide a note, then submit the action. You can use keyboard shortcuts to speed up moderation actions — for example, `S` for Submit.
ja: この場合、最も簡単なアクションは、それ以上のアクションをとらずにレポートを承認することです。ドロップダウンから「Ackonwledge」を選択し、メモを入力してアクションを送信します。キーボードショートカットを使用すると、モデレーションアクションを高速化できます。たとえば、Submitの「S」で送信できます。

source: In this guide, we're going to build a simple multi-user app that publishes your current "status" as an emoji. Our application will look like this: {{className: 'lead'}}
ja: このガイドでは、「ステータス」を絵文字として公開するシンプルなマルチユーザーアプリを構築します。アプリケーションは以下の画像のようになります。{{className: 'lead'}}

source: In this image, note that there are two different Lexicon groupings: *Bluesky* permissions, and *Skyblur* permissions. Each Lexicon defines its own permission sets, as well as its own grouping and presentation of those permissions.
ja: この画像では、*Bluesky*権限と*Skyblur*権限という2つの異なるLexiconのグループがあることに注目してください。各Lexiconは独自の権限セットを定義し、それらのグループと表示方法も独自に定義します。

source: In this post, we'll distill that ethos. First, we look at the movements in technology that have most directly influenced atproto.Then, we pull out the core innovations that atproto brought to the table. Finally, we highlight some opinionated ways of thinking that influenced the design. {{className: 'lead'}}
ja: この投稿では、そのethosを掘り下げます。まず、atprotoに最も直接的な影響を与えた技術的ムーブメントを見ていきます。次に、atprotoがもたらした中核的な革新を取り上げます。最後に、設計に影響を与えた主張の強い思考様式をいくつか紹介します。 {{className: 'lead'}}

source: In this section, you'll use the [Vercel AI SDK](https://www.npmjs.com/package/ai). This library provides a unified API to interact with model providers like Anthropic through the Vercel AI Gateway. You'll need to sign up for a free [Hobby project](https://vercel.com/) to get an API key.
ja: このセクションでは、[Vercel AI SDK](https://www.npmjs.com/package/ai)を使います。このライブラリは、Vercel AI Gateway経由でAnthropicなどのモデルプロバイダーを統一されたAPIで利用できます。APIキーを取得するには、無料の[Hobby project](https://vercel.com/)に登録する必要があります。

source: In this tutorial we've covered the key steps to building an atproto app. Data is published in its canonical form on users' `at://` repos and then aggregated into apps' databases to produce views of the network.
ja: このチュートリアルでは、atprotoアプリを構築するための重要な手順について説明しました。データは、ユーザーの`at://`リポジトリに正規形で公開され、その後、アプリのデータベースに集約されてネットワークのビューが生成されます。

source: In this tutorial, you'll build a Next.js app where users can log in with their AT Protocol identity using OAuth. If you [host your own PDS](/guides/self-hosting), that means you can provide your own auth source for any apps in the Atmosphere.
ja: このチュートリアルでは、OAuthを使ってユーザーがATプロトコルのIDでログインできるNext.jsアプリを作成します。[自分のPDSをホスト](/guides/self-hosting)している場合、Atmosphere上の任意のアプリに対して独自の認証ソースを提供できます。

source: In this tutorial, you'll build a status-setting app using custom Lexicons and real-time sync.
ja: このチュートリアルでは、カスタムLexiconとリアルタイム同期を使ってステータス設定アプリを作成します。

source: In this tutorial, you'll create a bot that authenticates with an [app password](/guides/sdk-auth) to interact with the network.
ja: このチュートリアルでは、[アプリパスワード](/guides/sdk-auth)で認証し、ネットワークとやり取りするボットを作成します。

source: In this tutorial, you'll create a custom feed server by consuming posts from the [firehose](http://localhost:3000/guides/streaming-data), algorithmically sorting them, and [broadcasting them as an XRPC feed](/guides/feeds).
ja: このチュートリアルでは、[firehose](http://localhost:3000/guides/streaming-data)から投稿を取り込み、アルゴリズムで並び替え、[XRPCフィードとして配信する](/guides/feeds)ことで、カスタムフィードサーバーを作成します。

source: In-app
ja: アプリ内

source: In-app notifications
ja: アプリ内通知

source: In-app, Everyone
ja: アプリ内、全員

source: In-app, People you follow
ja: アプリ内、フォロー中の人

source: In-app, Push
ja: アプリ内、プッシュ

source: In-app, Push, Everyone
ja: アプリ内、プッシュ、全員

source: In-app, Push, People you follow
ja: アプリ内、プッシュ、フォロー中の人

source: Inbox zero!
ja: 受信トレイが空です！

source: Incorrect username or password
ja: 無効なユーザー名またはパスワード

source: Input code sent to your email for password reset
ja: パスワードをリセットするためにあなたのメールアドレスに送られたコードを入力

source: Input confirmation code for account deletion
ja: アカウント削除のために確認コードを入力

source: Input new password
ja: 新しいパスワードを入力

source: Input password for account deletion
ja: アカウント削除のためにパスワードを入力

source: Input the code which has been emailed to you
ja: メールで送られたコードを入力

source: Instead of sending content and interactions to some coordinating backend service, users of social media platforms would send relevant data directly from their device to another device. If two users follow one another and one of them posts, the other would receive the post through a direct connection with the former's device. Of course, this requires that both parties are online at the same time for any data transfer to happen. P2p systems sought to get around this by allowing data to be replicated across many devices. Therefore a user may receive a post from the posting user or they could receive it from another friend that's currently online and in possession of the post.
ja: コンテンツや相互作用を調整役のバックエンドサービスへ送る代わりに、ソーシャルメディアのユーザーは、自分のデバイスから別のデバイスへ直接関連データを送ります。2人のユーザーが互いにフォローしていて片方が投稿した場合、もう片方は直接接続によってその投稿を受け取ります。もちろん、データ転送のためには両者が同時にオンラインである必要があります。P2Pシステムは、多数のデバイスにデータを複製することでこの問題を回避しようとしました。したがって、ユーザーは投稿者本人から投稿を受け取ることも、現在オンラインでその投稿を保持している別の友人から受け取ることもできます。

source: Interaction limited
ja: 反応が制限されています

source: Interaction settings
ja: 反応関連の設定

source: Introducing activity notifications
ja: アクティビティの通知の紹介

source: Introducing finding friends via contacts
ja: 連絡先から友達を見つける機能のご紹介

source: Introducing saved posts AKA bookmarks
ja: 保存済投稿、いわゆるブックマークを紹介します

source: Invalid 2FA confirmation code.
ja: 無効な2要素認証の確認コードです。

source: Invalid Verification Code
ja: 無効な確認コード

source: Invalid handle. Please try a different one.
ja: 無効なハンドルです。他のものを試してください。

source: Invalid interaction settings.
ja: 無効な反応関連の設定。

source: Invalid phone number
ja: 無効な電話番号

source: Invalid report subject
ja: 報告の件名が無効です

source: Invite
ja: 招待

source: Invite Friends
ja: 友達を招待

source: Invite code
ja: 招待コード

source: Invite code not accepted. Check that you input it correctly and try again.
ja: 招待コードが確認できません。正しく入力されていることを確認し、もう一度試してください。

source: Invite friends <0/>
ja: 友達を招待 <0/>

source: Invite people to this starter pack!
ja: このスターターパックにユーザーを招待！

source: Invite your friends to follow your favorite feeds and people
ja: お気に入りのフィードやユーザーをフォローするよう、あなたの友人を招待する

source: Invite {name} to join Bluesky
ja: {name}をBlueskyへ招待

source: Invites, but personal
ja: 招待、ただし個人的なもの

source: Is your location not accurate? <0>Tap here to confirm your location.</0>
ja: 位置情報は正確ですか？<0>ここをタップして現在位置を確認してください。</0>

source: It creates a standard format for user identity, follows, and data on social apps, allowing apps to interoperate and users to move across them freely. It is a federated network with account portability.
ja: ソーシャルアプリ上のユーザーID、フォロー、データの標準形式を作成し、アプリの相互運用とユーザーの自由なアプリ間移動を可能にします。これは、アカウントのポータビリティを備えたフェデレーションネットワークです。

source: It is difficult to change a PDS hostname once it has active accounts — every account needs to be migrated individually. This is absolutely possible using [PLC rotation keys], but migrating is not turnkey. Also note that the PDS is the domain that users will enter their passwords on (and therefore remembered in password managers).
ja: アクティブなアカウントを持つようになると、PDSホスト名の変更は困難です。すべてのアカウントを個別に移行する必要があります。これはPLCローテーション鍵を使えば間違いなく可能ですが、移行は簡単ではありません。また、PDSはユーザーがパスワードを入力するドメインである（したがってパスワードマネージャーで記憶される）ことに注意してください。

source: It is generally recommended to use an object storage implementation for working with blobs if you are hosting your own PDS. See [going to production](/guides/going-to-production#object-storage) for more.
ja: 自分自身のPDSをホストしている場合、blobを操作するにはオブジェクトストレージ実装の利用を一般的にお勧めします。詳細は[本番環境への移行](/guides/going-to-production#object-storage)を参照してください。

source: It is possible to design an application endpoint to allow submitting videos to a separate microservice for processing before creating a post. This method also allows for better UX, since you can show the processing state to the user and let them know if the processing job fails.
ja: アプリケーションエンドポイントを設計して、投稿を作成する前に動画を別のマイクロサービスに送信して処理することが可能です。この方法は処理状態をユーザーに表示し、処理ジョブが失敗した場合にそれを知らせるため、より良いUXを提供します。

source: It looks like some of your contacts have not tried to find you here yet. You can personally invite them by customizing a draft message we will provide.
ja: 連絡先の一部の方はまだあなたを見つけようとしていないようです。 私たちが提供するメッセージの下書きをカスタマイズして、個人的に招待することができます。

source: It may be worth double-checking with `com.atproto.server.checkAccountStatus` on both PDS instances to confirm that all the expected content has been migrated.
ja: すべてのコンテンツが移行されたことを確認するため、両方のPDSインスタンスで`com.atproto.server.checkAccountStatus`を呼び出して再確認することが有益な場合があります。

source: It will still be possible to login and authenticate with the old PDS. The user may wish to fully terminated their old account eventually. This can be automated with the `deleteAfter` parameter to the `com.atproto.server.deactivateAccount` request. Note that the old PDS may be able to assist with PLC identity recovery during a fixed 72hr window, but only if the account was not fully deleted during that window.
ja: 旧PDSでログインや認証を行うことは引き続き可能です。ユーザーは最終的に旧アカウントを完全に削除したい場合があります。これは`com.atproto.server.deactivateAccount`リクエストの`deleteAfter`パラメータで自動化できます。旧PDSは72時間固定のウィンドウ内でPLC識別子の復旧を支援できる場合がありますが、そのウィンドウ内でアカウントが完全に削除されていない場合に限ります。

source: It's correct
ja: 合ってます

source: It's important to secure the extra PLC identity rotation key for hosted accounts — e.g., in a [Key Management System](https://developer.hashicorp.com/vault/docs/secrets/key-management) or [Hardware Security Module](https://csrc.nist.gov/glossary/term/hardware_security_module_hsm). Pay attention to these two environment variables:
ja: ホストされたアカウント用の追加のPLC IDローテーション鍵を安全に保管することが重要です。例えば、[鍵管理システム](https://developer.hashicorp.com/vault/docs/secrets/key-management)または[HSM](https://csrc.nist.gov/glossary/term/hardware_security_module_hsm)内で。以下の2つの環境変数に注意してください。

source: It's just <0>{0} </0>right now! Add more people to your starter pack by searching above.
ja: ちょうど今<0>{0} </0>です！上記で検索して多くの人々をスターターパックに追加しましょう。

source: It's just you right now! Add more people to your starter pack by searching above.
ja: 今はあなただけ！上で検索してスターターパックにより多くのユーザーを追加してください。
